/* Error Code */

"DefaultError" = "Application has encountered network connection error.";
"SOMP-301" = "Invalid Username or Password.Please try again. (1301)";
"SOMP-302" = "Your account is closed. Please call 400-820-1188. (1302)";
"SOMP-303" = "欢迎您首次使用安吉星，注册码已经发送到您的邮箱：***@sina.com 及手机：1388****888,请查阅. (1303)";
"SOMP-304" = "Invalid registration code, please input again. (1304)";
"SOMP-305" = "Failed to obtain Registration Code. Please try again later. (1305)";
"SOMP-307" = "Registration Code has expired. Please request a new code. (1307)";
"SOMP-308" = "You have not registered myOnStar application. For registration, please visit www.onstar.com.cn. (1308)";
"SOMP-309" = "Your account is not authorized for using myOnStar application. Please call 400-820-1188. (1309)";
"SOMP-310" = "The application you are using is not from authorized vendor. Please call 400-820-1188. (1310)";
"SOMP-311" = "Login session expired, please login again. (1311)";
"SOMP-312" = "Invalid OnStar Password, you only have three times,  input it again. (1312)";
"SOMP-312-watch"="PIN code incorrect.(1312)";
"SOMP-313" = "Failed to set account and vehicle. Please try again later. (1313)";
"SOMP-314" = "Your phone has been registered. (1314)";
"SOMP-315" = "Security check failed, please login again. (1315)";
"SOMP-316" = "User profile was changed, please re-login. (1316)";
"SOMP-318" = "Register Code has exceed MAX try account. (1318)";
"SOMP-319" = "Your phone is deactivated. (1319)";
"SOMP-321" = "Remote control not opted in. (1321)";
"SOMP-323" = "Your account is being used from another phone. (1323)";
"SOMP-324" = "OnStar Password retry reaches 3 times system limit, your remote control feature will be locked for 30 minutes. Please retry later. (1324)";
"SOMP-324-watch"="PIN code failed for 3 times, would lock App for 30 minutes.(1324)";
"SOMP-325" = "Message does not exist.(1325)";
"SOMP-401" = "Failed to retrieve monthly vehicle report. Please try again later. (1401)";
"SOMP-402" = "Failed to retrieve OnStar True Story. Please try again later. (1402)";
"SOMP-403" = "Failed to retrieve Promotion Info. Please try again later. (1403)";
"SOMP-404" = "Failed to retrieve Tips. Please try again later. (1404)";
"SOMP-405" = "System error. (1405)";
"SOMP" = "System error:";
"SOMP-501" = "Failed to upgarde application. (1501)";
"SOMP-503" = "To protect your user experience, please update to the latest version.";//"Application must upgrade,Please access App Store to download latest version. (1503)";
"SOMP-504" = "New version for OnStar App, do you want to update?";
"SOMP-601" = "System error. (1601)";
"SOMP-603" = "Can not found notification email and phone number. (1603)";
"SOMP-604" = "Application has encountered system error. (1604)";
"SOMP-701" = "Failed to delete destination, please retry it";
"SOMP-702" = "Favorite don’t have enough space to save your destination, do you want to delete one destination from your current favorite?";
"SOMP-317" = "Security check failed, please login again. (1317)";
"SOMP-903" = "Application has encountered network connection error. (1903)";

//join me
"SOMP-326" = "Your mobile/email has been used please call 4008201188 to change your personal info to register.";
"SOMP-327" = "Your do not have email/mobile in OnStar,please call 4008201188 complement your personal information.";
"SOMP-328" = "Application has encountered network connection error.";
"SOMP-329" = "Register Code Invalid.";
"SOMP-330" = "Vin And GovernmentID All Are Null.";
"SOMP-331" = "Your vehicle has more than one identities, please enter certificate number to upgrade.";

"ONS-101" = "Login session expired, please login again. (0101)";
"ONS-104" = "User exceeded service execution limit. (0104)";
"ONS-105" = "System error. (0105)";
"ONS-106" = "System error. (0106)";
"ONS-107" = "System error. (0107)";
"ONS-108" = "System error. (0108)";
"ONS-110" = "System error. (0110)";
"ONS-201" = "System error. (0201)";
"ONS-210" = "System error. (0210)";
"ONS-211" = "Vehicle command cannot be executed due to invalid vehicle state. (0211)";
"ONS-212" = "System error. (0212)";
"ONS-213" = "System error. (0213)";
"ONS-214" = "System error. (0214)";
//"ONS-215" = "System error. (0215)";
"ONS-215" = "Unable to execute request. (0215)";
"ONS-216" = "System error. (0216)";
"ONS-217" = "System error. (0217)";
"ONS-218" = "System error. (0218)";
//"ONS-300" = "System error. (0300)";
"ONS-300" = "Oops! You may have another operation of remote control being processed. Please try again later. (0300)";
"ONS-801" = "System error. (0801)";
"ONS-802" = "System error. (0802)";
"ONS-803" = "System error. (0803)";
"ONS-804" = "System error. (0804)";
"ONS-900" = "System error. (0900)";
"ONS-901" = "System error. (0901)";
"ONS-902" = "System error. (0902)";
"ONS-903" = "System error. (0903)";
"ONS-910" = "System error. (0904)";

"getReportSystemError" = "OnStar Vehicle Diagnostic report is currently not available.(1601)";

/* Create DataBase Form */
"createDataBaseForm" = "CREATE TABLE IF NOT EXISTS %@ (vin INTEGER PRIMARY KEY, vehicleRange TEXT);";

/* #define XML Format Error */
"xmlFormatError" = "Application has encountered network connection error. (1903)";

/* Unknow Error Code */
"unknownErrorCode" = "Unknown Error (%@)";
"unknownError" = "Unknown Error";

/* Get SAML Token false*/
"getSAMLTokenFalse" = "Security check failed, please login again. (1905)";

/*Info Page Back Button Title */
"infoPageButtonBackTitle" = "back";

/* Check RPO Vehicle */
"checkRPOVehicle" = "CTS";

/***********************************Tabbar Items ******************************/
"tabbarItemIndex" = "Home";
"tabbarItemVehicle" = "Vehicle";
"tabbarItemRemote" = "Remote";
"tabbarItemCharge" = "Charge";
"tabbarItemNavigate" = "Navigation";
"tabbarItemDiscover" = "Finding";
"tabbarItemMe" = "Me";
//"tabbarItemAssistant" = "Assistant";
//"tabbarItemOption" = "Options";
"tabbarItemAssistant" = "Information";
"tabbarItemOption" = "Personal";
"navigationTitleMore" = "More";
/***********************************Tabbar Items ******************************/


/***********************************Waitting Page******************************/
/* Now is sending request */
"nowIsSenddingRequest" = "Sending request";

/* Please Waite */
"pleaseWaite" = "Please wait";
/***********************************Waitting Page******************************/


/**************************************Login Page******************************/
/* username */
"username" = "Username";

/* password */
"password" = "Password:";

/* rememberMe */
"rememberMe" = "Remember Me";

/* Username Is Null */
"usernameIsNull" = "Please input your username";

/* Password Is Null */
"passwordIsNull" = "Please input your password";

/*Login Info Navigation Title Lable */
"loginInfoNavigateTitle" = "Login";

/*Login Info Status Title Lable */
"loginInfoStatusTitle" = "Login Tips";

/* Login Info Content */
//"loginInfoContent" = "OnStar mobile application is tailor-made for OnStar subscribers. To log on this application, please register in \"My OnStar\" at www.OnStar.com.cn and opt-in mobile app function in the mobile app setting. The username and password for this application is consistent with your \"My Onstar\" username and password.";

"loginInfoContent" = "To log on this application, please register in \"My OnStar\" at www.OnStar.com.cn and opt-in mobile app function in the mobile app setting. The username and password for this application is consistent with your \"My Onstar\" username and password.";

/* Upgrade Mandatory */
"upgradeMandatory" = "Your application version is too old,please upgrade to enjoy more services";

/* Upgrade Optional */
"upgradeOptional" = "New app version is available. Upgrade now?";

/* Upgrade Not Needed */
"upgradeNotNeeded" = "This is the newest version, do not need update";

/* Upgrade Ok Button */
"upgradeOKButton" = "OK";

/* Upgrade Cancel Button */
"upgradeCancelButton" = "Cancel";
/**************************************Login Page******************************/

/************************************Registe Page******************************/
/* Registe Code */
"registeCode" = "Registration Code";

/* Nick Name */
"nickName" = "Nickname";

/*Registe Status Title Lable */
"registeNavigateTitle" = "Registration";

/* RegCode or Nickname can not be null*/
"regcodeOrNicknameIsNull" = "You must enter registration code and nickname";

/* Button OK title */
"regButtonOkTitle" = "OK";

/* Button reset title */
"regButtonResetTitle" = "Reset";

/* Button Registe Code Title */
"regButtonRegcodeTitle" = "Request a New Code";

/* Not registe message with email and phone */
"needActivateDevice" = "Welcome to use Onstar Mobile App, for first time using, please enter your register code which has been sent to your email:%@ and mobile:%@. Please check there.";

/* Not registe message with email */
"needActivateDeviceWithEmail" = "Welcome to use Onstar Mobile App, for first time using, please enter your register code which has been sent to your email:%@. Please check there.";

/* Not registe message with phone*/
"needActivateDeviceWithPhone" = "Welcome to use Onstar Mobile App, for first time using, please enter your register code which has been sent to your mobile:%@. Please check there.";

/* Label Refresh Data */
"labelRefreshData" = "Retrieving vehicle data,may take one minute.";

/* Registe Info Status Title Lable */
"registeInfoStatusTitle" = "Registration Tips";

/* Registe Info Content */
"registeInfoContent" = "Registration code will be sent to your first registered mobile phone number or Email  via email and SMS. Please input the registration code into the field.

Note: the registration code expires in 24 hours. After that, you can click \"regenerate reg-code\" button to get a new reg-code.

The nickname is used to identify your smartphones. If you have the Mobile Application installed on multiple smartphones and share the same account, you can recognize your different smartphones on \"My OnStar\" by the nickname.";
/************************************Registe Page******************************/


/************************************Home Page*********************************/
/* Home Page navigate title label */
"homeNavigateTitle" = "Vehicle Status";

/*Fuel In Gas Title */
"fuelInGasTitle" = "Fuel Level";
"fuelBatteryTitle" = "Fuel/Battery Level";
"batteryTitle" = "Battery Level";
"fuelTitle" = "Fuel Level";
"labelFuelInGasMark" = "Can't Get";

"dropDownRefresh" = "Drop down refresh to learn the status of your vehicle!";
"dropDownRefreshFailure" = "Diagnosing failed, try again later.";
"loginRegister" = "Login/Register";

/*Fuel In Gas Measure */
"fuelInGasMeasure" = "L";

/* Oil In Gas Title */
"OilInGasTitle" = "Oil Life";

/* Available Range */
"avaliableRangeMile" = "Fuel Range";
"avaliableRangeMileEV" = "Fuel Range";

/* Post Available Range */
"postAvailableRange" = "Km";

/* Pre Total Mile */
"preTotalMile" = "Odometer";

/* Post Total Mile */
"postTotalMile" = "Km";

/* Pre Ave Gas Cost */
"preAveGasCost" = "Life Time Fuel Eco";

/* Post Ave Gas Cost */
"postAveGasCost" = "L/100Km";

/* Pre Last Trip */
"preLastTrip" = "Last Trip";
"preLastTripEV" = "Since Full Charge Distance";

/* PostLastTrip */
"postLastTrip" = "Km";

/* Pre Last Gas Cost */
"preLastGasCost" = "Fuel ECON(Last)";
"preLastGasCostEV" = "Since Full Charge Fuel Eco";

/* PostLastGasCost */
"postLastGasCost" = "L/100Km";

/*Home Data update time */
"homeDataUpdateTime" = "%@/%@ %@:%@";
"homeDataUpdateTimeTitle" = "Updated by";
/* Placard Front Title */
"placardFrontTitle" = "Reference Value";

/* Unit */
"psi" = "KPA";
"kpa" = "KPA";
"Kpa" = "KPA";

/* Request ID Dose Not Match */
"requestIDDoseNotMatch" = "Failed to update from vehicle.";

/* Update Data false */
"homeUpdateDataFalse" = "------";

/* Polling Get Vehicle Data Failure Message With Code*/
"pollingGetVehicleDataFailureMessageWithCode" = "Fail to refresh vehicle data. (%@)";

/* Polling Get Vehicle Data Failure Message*/
"pollingGetVehicleDataFailureMessage" = "Fail to refresh vehicle data.(%@) ";
"pollingGetVehicleDataTimeOut" = "Fail to refresh vehicle data. ";

/*Home Info Status Title Lable */
"homeInfoStatusTitle" = "Vehicle Status Tips";

/* Home Front Page Info Content */
"homeFrontInfoContent" = "For the first use, the application will automatically refresh the vehicle data, which takes 1 to 3 minutes. Otherwise, the screen  will show the latest updated vehicle data of your selected vehicle.

You can choose to \"refresh the vehicle data automaticlly when log-in\" in setting.

You can click the button on the right-top to refresh the vehicle data. In the meantime, you can drag/switch the page to display other information.

Note: all vehicle data is the data when vehicle is ignition-off.";

/* Home Front Page Info Content for volt*/
"homeFrontInfoContentVolt" = "For the first use, the application will automatically refresh the vehicle data, which takes 1 to 3 minutes. Otherwise, the screen  will show the latest updated vehicle data of your selected vehicle.

You can choose to \"refresh the vehicle data automaticlly when log-in\" in setting.

You can click the button on the right-top to refresh the vehicle data. In the meantime, you can drag/switch the page to display other information.

Note: all vehicle data is the data when vehicle is ignition-off.";



/* Home Back Page Info Content */
"homeBackInfoContent" = "For the first use, the application will automatically refresh the vehicle data, which takes 1 to 3 minutes. Otherwise, the screen  will show the latest updated vehicle data of your selected vehicle.

You can choose to \"refresh the vehicle data automaticlly when log-in\" in setting.

You can click the button on the right-top to refresh the vehicle data. In the meantime, you can drag/switch the page to display other information.

Note: all vehicle data is the data when vehicle is ignition-off.";

/* Home Back Page Info Content for volt*/
"homeBackInfoContentVolt" = "For the first use, the application will automatically refresh the vehicle data, which takes 1 to 3 minutes. Otherwise, the screen  will show the latest updated vehicle data of your selected vehicle.

You can choose to \"refresh the vehicle data automaticlly when log-in\" in setting.

You can click the button on the right-top to refresh the vehicle data. In the meantime, you can drag/switch the page to display other information.

Note: When the vehicle is off, the vehicle data displayed would be the last one received before ignition was tunred off.";


"homeEVInfoContent" = "For the first use, the application will automatically refresh the vehicle data, which takes 1 to 3 minutes. Otherwise, the screen  will show the latest updated vehicle data of your selected vehicle.

You can choose to \"refresh the vehicle data automaticlly when log-in\" in setting.

You can click the button on the right-top to refresh the vehicle data. In the meantime, you can drag/switch the page to display other information.

Note: all vehicle data is the data when vehicle is ignition-off.";

"homeEVInfoContentBev" = "For the first use, the application will automatically refresh the vehicle data, which takes 1 to 3 minutes. Otherwise, the screen will show the latest updated vehicle data of your selected vehicle.

You can choose to \"refresh the vehicle data automaticlly when log-in\" in setting.

Note: all vehicle data is the data when vehicle is ignition-off.";
/************************************Home Page*********************************/


/***********************************Home Page EV*******************************/
"BatteryLableTitle" = "Battery";
"rangeLabelEvRange" = "EV Range";
"rangeLabelTotleRange" = "Total Range";
"rangeLabelMileage" = "Km";
"chargeTimeLabelNext" = "Next Charge";
"chargeTimeLabelFull" = "Full Charge";
"chargeModeImmediately" = "Immediately";
"chargeModeDelayedDeparture" = "Delayed - Departure time";
"chargeModeDelayedRate" = "Delayed - Rate & Departure time";
"chargeStateCharging" = "Charging";
"chargeStateNotCharging" = "Not Charging";
"chargeStateChargeAbort" = "Charging Aborted";
"chargeStateFulllyCharge" = "Fully Charged";
"ChargeStateGetting"="Retrieving charge status";
/***********************************Home Page EV*******************************/


/******************************Remote Control Page*****************************/
/* Remote Control Page navigate title label */
"remoteNavigateTitle" = "Remote Control";

/* Remote Lock Initiate Sucess */
"remoteLockInitiateSucess" = "Door Lock, your request has been accepted, please wait 1 to 3 minutes.";

/* Remote Unlock Initiate Sucess */
"remoteUnlockInitiateSucess" = "Door Unlock, your unlock request has been accepted, please wait 1 to 3 minutes.";

/* Remote Satrt Initiate Sucess */
"remoteStartInitiateSucess" = "Remote Start, your request has been accepted, please wait 1 to 3 minutes.";

/* Remote Stop Initiate Sucess */
"remoteStopInitiateSucess" = "Cancel Start, your request has been accepted, please wait 1 to 3 minutes.";

/* Remote Satrt Initiate Sucess */
"remoteStartInitiateSucessBEV" = "PRE A/C ON, your request has been accepted, please wait 1 to 3 minutes.";

/* Remote Stop Initiate Sucess */
"remoteStopInitiateSucessBEV" = "PRE A/C OFF, your request has been accepted, please wait 1 to 3 minutes.";


/* Remote Alert Initiate Sucess */
"remoteAlertInitiateSucess" = "Horn & Lights, your request has been accepted, please wait 1 to 3 minutes.";

/* Polling False */
"pollingFailureMessage" = "operation failure";

/* Polling Lock Door Sucess Message */
"pollingLockDoorSucessMessage" = "Door Lock successfully.";
"pollingLockDoorFailureMessage" = "Failed to execute Door Lock command.(%@) ";
"pollingLockDoorTimeOut" = "%@ %@, Failed to execute Door Lock command. ";

/* Polling Unlock Door Sucess Message */
"pollingUnlockDoorSucessMessage" = "Door Unlock successfully.";
"pollingUnlockDoorFailureMessage" = "Failed to execute Door Unlock command.(%@)";
"pollingUnlockDoorTimeOut" = "Failed to execute Door Unlock command. ";

/* Polling Remote Start Sucess Message */
"pollingRemoteStartSucessMessage" = "Ingition on successfully.";
"pollingRemoteStartFailureMessage" = "Failed to execute Ingition on command.(%@)";
"pollingRemoteStartTimeOut" = "Failed to execute Ingition on command. ";


/* Polling Remote Stop Sucess Message */
"pollingRemoteStopSucessMessage" = "Ingition off successfully.";
"pollingRemoteStopFailureMessage" = "Failed to execute Ingition off command.(%@)";
"pollingRemoteStopTimeOut" = "Failed to execute Ingition off command. ";


/* Polling Remote Start Sucess Message for BEV */
"pollingRemoteStartSucessMessageBEV" = "%@ %@, succeeded to execute PRE A/C ON.";
"pollingRemoteStartFailureMessageBEV" = "%@ %@, Failed to execute PRE A/C ON command.(%@)";
"pollingRemoteStartTimeOutBEV" = "%@ %@, Failed to execute PRE A/C ON command. ";


/* Polling Remote Stop Sucess Message for BEV */
"pollingRemoteStopSucessMessageBEV" = "%@ %@, succeeded to execute PRE A/C OFF.";
"pollingRemoteStopFailureMessageBEV" = "%@ %@, Failed to execute PRE A/C OFF command.(%@) ";
"pollingRemoteStopTimeOutBEV" = "%@ %@, Failed to execute PRE A/C OFF command. ";



/* Polling Vehicle Alert Sucess Message */
"pollingVehicleAlertSucessMessage" = "Horns & Lighs successfully.";
"pollingVehicleAlertFailureMessage" = "Failed to execute Horn & Lights command.(%@)";
"pollingVehicleAlertTimeOut" = "Failed to execute Horn & Lights command. ";

/* Lable Recent Status Title */
"recentStatusTitle" = "Recent history";

/* Button Lock Title */
"remoteLockButtonTitle" = "Door Lock";

/* Button Unlock Title */
"remoteUnlockButtonTitle" = "Door Unlock";

/* Button Remote Start Title */
"remoteRemoteStartButtonTitle" = "Remote Start";

/* Button Remote Stop Title */
"remoteRemoteStopButtonTitle" = "Cancel Start";

/* Button Remote Start Title */
"remoteRemoteStartButtonTitleVolt" = "PRE A/C ON";

/* Button Remote Stop Title */
"remoteRemoteStopButtonTitleVolt" = "PRE A/C OFF";

/* Button Vehicle Alert Title */
"remoteVehicleAlertButtonTitle" = "Horn & Lights";

/* Button Recent Status Title */
"remoteRecentStatusButtonTitle" = "Recent History";

/*Vehicle Dose not support this feature */
"vehicleDoseNotSupportTheFeature" = "Your vehicle dose not support this feature";

/* Remote Control Opt In */
"remoteControlOptIn" = "You don’t opt-in remote control, please visit www.onstar.com.cn, login and opt-in this service in “Mobile Service”.";

/* Remote Control Info Status Title Lable */
"remoteControlInfoStatusTitle" = "Remote Control Tips";

/* Remote Control Info Content */
"remoteControlInfoContent" = "OnStar mobile application provides 5 remote control functions and the history list.

Door Lock: this app can remotely lock your doors.

Door Unlock: this app can remotely unlock your doors.

Remote start: if you keep your air-conditioning on before ignition-off, the remote start will start the pre-conditioning.

Cancel Start:  this app can remotely cancel your remote start command.

Horn&Lights:  this app can alert your vehicle by horn or/and light to locate your vehicle.

Recent Hisotry: For checking your latest remote control operations.

Note:

1. Remote control function capability varies by vehicle type.

2. During one ignition-on cycle, only two remote start operation are permitted. When the door is open or the key is on the vehicle, all the remote start operation will not work.

3. Remote control operations will be rejected once the vehicle is moving.

4. The horn & light service willl last for 30 seconds until any of the following occurs:
a) The driver door is opened
b) The vehicle is turned on with the key (or keyless ignition switch if equipped)
c) A period of 30 seconds elapses.";

/* Remote Control Info Content for Volt*/
"voltRemoteControlInfoContent" = "OnStar mobile application provides 5 remote control functions and the history list.

Door Lock: this app can remotely lock your doors.

Door Unlock: this app can remotely unlock your doors.

Remote start: if you keep your air-conditioning on before ignition-off, the remote start will start the pre-conditioning. if there is no charge remaining, this function may start the engine.

Cancel Start:  this app can remotely cancel your remote start command.

Horn&Lights:  this app can alert your vehicle by horn or/and light to locate your vehicle.

Recent Hisotry: For checking your latest remote control operations.

Note:

1. Remote control function capability varies by vehicle type.

2. During one ignition-on cycle, only two remote start operation are permitted. When the door is open or the key is on the vehicle, all the remote start operation will not work.

3. Remote control operations will be rejected once the vehicle is moving.

4. The horn & light service willl last for 30 seconds until any of the following occurs:
a) The driver door is opened
b) The vehicle is turned on with the key (or keyless ignition switch if equipped)
c) A period of 30 seconds elapses.";


/* Remote Control Info Content for Bev*/
"RemoteControlInfoContentBev" = "OnStar mobile application provides 5 remote control functions and the history list.

Door Lock: this app can remotely lock your doors.

Door Unlock: this app can remotely unlock your doors.

Pre A/C On: For remote start your Cabin Pre-condition.

Pre A/C Off: For remotely canceling your start command.

Horn&Lights:  this app can alert your vehicle by horn or/and light to locate your vehicle.

Recent Hisotry: For checking your latest remote control operations.

Note:

1. Remote control function capability varies by vehicle type.

2. During one ignition-on cycle, only two remote start operation are permitted. When the door is open or the key is on the vehicle, all the remote start operation will not work.

3. Remote control operations will be rejected once the vehicle is moving.

4. The horn & light service willl last for 30 seconds until any of the following occurs:
a) The driver door is opened
b) The vehicle is turned on with the key (or keyless ignition switch if equipped)
c) A period of 30 seconds elapses.";


/* Recent History Info Status Title Lable */
"recentHistoryInfoStatusTitle" = "Recent History Tips";

/* Recent History Info Content */
"recentHistoryInfoContent" = "This function shows the last record of the following 5 remote control operations: Door Lock, Door Unlock, Remote Start, Cancel Remote Start and Vehicle Alert.";
"recentHistoryInfoContentWithVolt" = "This function shows the last record of the following 6 remote control operations: Door Lock, Door Unlock, Remote Start, Cancel Remote Start, Vehicle Alert and Start Charge Now (Volt only).";

/* Recent History Info Content for BEV*/
"recentHistoryInfoContentBev" = "This function shows the last record of the following 6 remote control operations: Door Lock, Door Unlock, Pre A/C On, Pre A/C Off, Vehicle Alert and Start Charge Now.";

/* Remote Control Unknown Error */
"remoteControlUnknownError" = "Oops! You may have another operation of remote control being processed. Please try again later. (0300)";

/* Remote Control ONS Error */
"remoteControlONSError" = "%@ %@, failed to execute %@. (%@)";

/* Remote Control Operation Tips */
"remoteOperationTips" = "Are you sure to excute this operation ?";

/* Remote Control Operation Tips OK */
"remoteOperationTipsOK" = "OK";

/* Remote Control Operation Tips Cancel */
"remoteOperationTipsCancel" = "Cancel";

/* Recent History Date Format */
"remoteRecentHistoryDateFormat" = "%@/%@/%@ %@:%@:%@";
/******************************Remote Control Page*****************************/

/*****************************Remote Input Pin Page****************************/
/* Button OK title */
"pincodeButtonOkTitle" = "Confirm";

/* Button reset title */
"pincodeButtonCancelTitle" = "Cancel";

/* Horn or Light Must Choose one */
"hornOrLightMustChooseOne" = "Must select at least one (Horn, Lights)";

/* Pin code is Null */
"pinCodeIsNull" = "OnStar Password can’t be empty, and only accepts alphabetic character and digit.";

"pincodeTitle" = "OnStar PIN";

/* Pin code Info Status Title Lable */
"pincodeInfoStatusTitle" = "OnStar Password Tips";

/* Pin Code Info Content */
"pincodeInfoContent" = "OnStar Password is the Onstar personal identification code with letters and digits and it differs from the username for login. For security purposes, the OnStar Password is mandatory for some Onstar remote control services, includeing Door Lock/Unlock, Remote Start, Cancel Start and Horn&Lights.

Please keep it secure. If you  forget the OnStar Password or need to change it, please call Shanghai OnStar (400-820-1188), our 24/7 advisors will help you.";

/* Pin Code Info Content for BEV*/
"pincodeInfoContentBev" = "OnStar Password is the Onstar personal identification code with letters and digits and it differs from the username for login. For security purposes, the OnStar Password is mandatory for some Onstar remote control services, includeing Door Lock/Unlock, Pre A/C On, Pre A/C Off and Horn&Lights.

Please keep it secure. If you  forget the OnStar Password or need to change it, please call Shanghai OnStar (400-820-1188), our 24/7 advisors will help you.";

/* Pin code Horn Light Info Status Title Lable */
"pincodeHornLightInfoStatusTitle" = "Horn & Lights Tips";

/* Pin Code Horn Light Info Content */
"pincodeHornLightInfoContent" = "For Horn & light service, you can select one or both.

Note: The service will last for 30 seconds until any of the following occurs:

1. The driver door is opened

2. The vehicle is turned on with the key (or keyless ignition switch if equipped)

3. A period of 30 seconds elapses.";

/*****************************Remote Input pin Page****************************/

/********************************Charge  Page**********************************/
/* Charge Page navigate title label */
"chargeNavigateTitle" = "Charge Mode";
"chargeModeImmediateTitle" = "Immediately";
"chargeModeImmediateExplain" = "Charge starts upon plug-in";
"chargeModeDepartureTitle" = "Delayed - Departure Time";
"chargeModeDepartureExpain" = "Charge starts based on departure time\nwhich configure in your vehicle";
"chargeModeRateTitle" = "Delayed - Rate & Departure Time";
"chargeModeRateExpain" = "Charge starts based on rate and departure\ntime which configure in your vehicle";
"chargeModeTips" = "You can't change the charge mode in the Mobile APP,if you want to change it, please configure in your vehicle.";
"buttonChargeNowTitle" = "Start Charge Now";
"buttonViewDepartureTimeTitle" = "View Departure Time";
"buttonSearchChargeStationTitle" = "Search Charge Sation";
"chargeNowInitiateSucess" = "Charge Now, your request has been accepted, please wait 1 to 3 minutes.";
"viewDepartureTimeInitiateSucess" = "View Departure Time, your request has been accepted, please wait 1 to 3 minutes.";
"defaultSearchChargeStation" = "电动汽车充电站";

"chargeNowHint" = "Are you sure to excute this operation?";

"pollingGetChargeModeSucessMessage" = "%@ %@, succeeded to execute Get Charge Mode.";
"pollingGetChargeModeFailureMessage" = "Failed to execute Get Charge Mode command.(%@) ";
"pollingGetChargeModeTimeOut" = "Failed to execute Get Charge Mode command. ";

"pollingChargeNowSucessMessage" = "%@ %@, succeeded to execute Charge Now.";
"pollingChargeNowFailureMessage" = "%@ %@, Failed to execute Charge Now command.(%@) ";
"pollingChargeNowTimeOut" = "%@ %@, Failed to execute Charge Now command. ";

"pollingDepartureTimeSucessMessage" = "%@ %@, succeeded to execute View Depature Time.";
"pollingDepartureTimeFailureMessage" = "%@ %@, Failed to execute View Depature Time command.(%@) ";
"pollingDepartureTimeTimeOut" = "%@ %@, Failed to execute View Depature Time command. ";

"pollingGetChargeFailureMessageWithCode" = "Fail to refresh charge mode. (%@)";
"pollingChargeOverrideFailureMessageWithCode" = "%@ %@, failed to execute charge override. (%@)";
"pollingDepartureTimeFailureMessageWithCode" = "%@ %@, failed to execute View Departure Time. (%@)";

"viewDepartureTableTitle" = "View Departure Time";
"departureConfirmButton" = "Confirm";
"departureDayMonday" = "Monday";
"departureDayTuesday" = "Tuesday";
"departureDayWednesday" = "Wednesday";
"departureDayThursday" = "Thursday";
"departureDayFriday" = "Friday";
"departureDaySaturday" = "Saturday";
"departureDaySunday" = "Sunday";

"chargeNow215Error" = "Failed to execute charge override, we search the reason for you, please wait one to three minutes. (0900)";
"chargeNow215ErrorNotPlugIn" = "Without the thrust line. (0xxx)";
"chargeNow215ErrorIsCharging" = "Charging. (0xxx)";
"chargeNow215ErrorBatteryFull" = "Already filled the electricity. (0xxx)";
"chargeNow215ErrorUnknown" = "Unknow system error. (0xxx)";

"chargeModeUnknownError" = "Fail to refresh charge mode. (0300)";
"chargeRefreshTitle" = "Updating Charge Mode";
/********************************Charge  Page**********************************/
"LoadingTitle" = "loading...";


/**********************************OVD Email Page******************************/
/*VotElectricDrive*/
"voltOvdDrive" = "Electric Drive Unit";

/*LithiumBattery*/
"voltOvdBattery" = "Lithium-Ion Battery";

/*DynamoelectricBrake*/
"voltOvdBrake" = "Regenerative Braking System";

/* engineTransmission */
"voltOvdEngineTransmission" = "Engine Generator Unit";

/* drainage */
"voltOvdDrainage" = "Emissions Control System";

/* airBag */
"voltOvdAirBag" = "Air Bag System";

/* stabiliTrak */
"voltOvdStabiliTrak" = "StabiliTrak System";

/* engineTransmission */
"voltOvdOnStar" = "OnStar System";




/*DynamoelectricBrake*/
"ovdABSSystem" = "Antilock Braking System";

/* engineTransmission */
"ovdEngineTransmission" = "Engine and Transmission System";

/* drainage */
"ovdDrainage" = "Emissions System";

/* airBag */
"ovdAirBag" = "Air Bag System";

/* stabiliTrak */
"ovdStabiliTrak" = "StabiliTrak Stability Control System";

/* engineTransmission */
"ovdOnStar" = "OnStar System";



/* Status Info */
"ovdStatusInfo" = "Status Info";

/* Maintenance Info */
"ovdMaintenanceInfo" = "Maintenance Info";

/* STATUS GOOD TEXT */
"ovdStatusGoodText" = "Complete diagnostics check, no action required.";

/* STATUS QUATE TEXT */
"ovdStatusQuateText" = "Unable to check the status, please contact OnStar.";

/* STATUS CRITICAL TEXT */
"ovdStatusCriticalText" = "There may be issue for your vehicle, please contact dealers.";

/* Vehicle Maintenance */
"ovdVehicleMaintenance" = "Vehicle Maintenance";

/* Remaining Oil Life */
"ovdRemainingOilLife" = "Remaining Oil Life:%@％";

/* Total Mileage */
"ovdTotalMileage" = "Total Mileage:%@Km";

/* Contact dealer for immediate repair */
"ovdContactDealer" = "Contact dealer for immediate repair.";

/* Tire Pressure Monitor */
"ovdTirePressureMonitor" = "Tire Pressure Monitor";

/* Recommended pressure*/
"ovdRecommendedPressure" = "Recommended pressure-Front %@ KPA,Rear %@ KPA";

/* Front Left */
"ovdFrontLeft" = "Front Left:\n%@KPA";

/* Rear Left */
"ovdRearLeft" = "Rear Left:\n%@KPA";

/* Front Right */
"ovdFrontRight" = "Front Right:\n%@KPA";

/* Rear Right */
"ovdRearRight" = "Rear Right:\n%@KPA";
/**********************************OVD Email Page******************************/


/***********************************Navigate Page******************************/
/* No Search Result label */
"navigateNoSearchResultTitle" = "No related information";

"navigateVicleRoteSearchResultTitle" = "Vehicle position resolution fail，Path is not saved";

"navigateCurrentRoteSearchResultTitle" = "My position resolution fail，Path is not saved";

/* Navigate Page navigate title label */
"navigateNavigateTitle" = "Navigation";

/* Navigate Page Around Search Button Title */
"navigateAroundSearchButtonTitle" = "Search nearby";

/* Navigate Page Name Search Button Title */
"navigateNameSearchButtonTitle" = "Search by name";

/* Name Search Page Status Label Title */
"navigateNameSearchStatusTitle" = "Search by name";

/* Name Search Page Choose City Button Title */
"navigateNameSearchChooseCityTitle" = "City";

/* Name Search Page WithoutMap Classify Button Title */
"navigateNameSearchWithoutMapClassify" = "Category";

/* Name Search Page WithoutMap Search Button Title */
"navigateNameSearchWithoutMapSearch" = "Search";

/* Name Search Page WithoutMap Current Location Button Title */
"navigateNameSearchWithoutMapCurrentLocation" = "Current location";

/* Navigate Page Destination Save Button Title */
"navigateDestinationSaveButtonTitle" = "Favorite";

/* Navigate Page History Button Title */
"navigateHistoryButtonTitle" = "History";

/* AroundSearch Page Status Title */
"navigateAroundSearchStatusTitle" = "Search nearby";

/* POI Search Title */
"navigatePOISearchStatusTitle" = "Search Result";

/* AroundSearch Page Seach Scope Button Title */
"navigateAroundSearchSeachScopeTitle" = "Scope";

/* AroundSearch Page Classify Button Title */
"navigateAroundSearchClassifyTitle" = "all Categories";

"searchCategoryAllTitle" = "All Category";
/* AroundSearch Classify Page Title */
"navigateAroundSearchClassifyPageTitle" = "              Destination Category";

/* NameSearch Classify Page Title */
"navigateNameSearchClassifyPageTitle" = "              Destination Category";

/* Search Result Detail Phone Title */
"navigateSearchResultDetailPhoneTitle" = "Tel:";

/* Search Result Detail Address Title */
"navigateSearchResultDetailAddressTitle" = "Add:";

/* Search Result Detail Not Support Call */
"ContactNotSupport" = "You can use mobile phone to call OnStar customer service hotline 400-820-1188";

/* Search Result Detail Send To Car Label */
//"navigateSearchResultDetailSendToCar" = "    Send to TBT";
//"navigateSearchResultDetailSendODD" ="    Send to ODD";

"navigateSearchResultDetailSendToCar" = "          Turn-by-Turn Navigation";
"navigateSearchResultDetailSendODD" =   "   On-Board Navigation";
"searchNearby" =                        "Search Nearby      ";
"navigateSearchResultDetailSendToCarIPad" = "                     Turn-by-Turn Navigation";
"navigateSearchResultDetailSendODDIPad" =   "                 On-Board Navigation";
"searchNearbyIPad" =                        "      Search Nearby";

/* Search Result Detail Show Map Label */
"navigateSearchResultDetailShowMap" = "Show on the map";

/* Search Result Detail Save Label */
//"navigateSearchResultDetailSave" = "    Save to favorite";
"navigateSearchResultDetailSave" = "Save";

/* Search Result Detail Delete Label */
"navigateSearchResultDetailDelete" = "Delete";

/* Navigate Send To TBT Initiate Sucess */
"navigateSendToTBTInitiateSucess" = "The route is sending. Please wait for 1-3 mins.";

/* Polling Send To TBT Sucess Message */
"pollingSendToTBTSucessMessage" = "The route was sent. Please check in your vehicle
*If you can’t successfully receive the route, please try again.";
"pollingSendToTBTFailureMessage" = "Oops! Send to Turn-by-Turn Navigation was timed out, please try again later.(%@)";
"pollingSendToTBTFailureMessageWithCode" = "Oops! Send to Turn-by-Turn Navigation was timed out, please try again later.(%@)";
"pollingSendToTBTTimeOut" = "Oops! Send to Turn-by-Turn Navigation was timed out, please try again later.";



"navigateSendToODDInitiateSucess" = "The destination is sending. Please wait for 1-3 mins.";
"pollingSendToODDSucessMessage" = "The destination was sent. Please check in your vehicle
*If you can’t successfully receive the destination, please try again. ";
"pollingSendToODDFailureMessage" = "Oops! Send to On-Board Navigation was timed out, please try again later.(%@)";
"pollingSendToODDFailureMessageWithCode" = "Oops! Send to On-Board Navigation was timed out, please try again later.(%@)";
"pollingSendToODDTimeOut" = "Oops! Send to On-Board Navigation was timed out, please try again later.";
/* Navigate Favorite List Status Title */
"navigateFavoriteListStatusTitle" = "Favorite";

/* Navigate History Status Title */
"navigateHistoryStatusTitle" = "History";

/* Navigate City Center */
"navigateCityCenter" = "人民政府";

/* Navigate Save Destination Success */
"navigateSaveDestinationSuccess" = "Succeed to save destination";

/* Navigate Ensure Delete Destination */
"navigateEnsureDeleteDestination" = "Are you sure to delete the POI?";

"navigateDeleteDestinationSuccess" = "Succeed to delete destination";
/* Navigate Search Without Key Words */
"navigateSearchWithoutKeyWords" = "Please enter the key word";

/* Navigate Can't get current location */
"navigateCan'tGetCurrentLocation" = "Can’t get the current location, please try later";
"navigateGPSOff" = "Please turn on your GPS and then try again";

/* Navigate Page Info Status Title Lable */
"navigateInfoStatusTitle" = "Destination help";

/* Nagigate Page Info Content */
"NavigateInfoContent" = " You can search destination by your phone, send the destination to vehicle, and voice-guided navigation will with you all the way

Search around: You can find POI (hotels, restaurants, gas station) within a certain distance according to your current location, send destination to vehicle, and voice-guided navigation will with you all the way.

Search by name: You can search POI in the selected city, send destination to vehicle, voice-guided navigation will with you all the way.

Favorite: You can save frequented destination to Favorites. The destination in the Favorites is sent to vehicle, or show on the mobile map.

History: You can view the recent operation history.";

/*nick name not null*/
"desinationNickName" = "Destination can’t  be empty";


"carIsCadillac" = "This service just can be used when vehicle is ignition on";
"needSendToCar" = "Sure";
"cacelSendToCar" = "Cancel ";

"navigateSearchTextFieldPlaceHolder" = "Only support pinyin";

"ResultListShowMoreN" = "View %d more";

"carLocationNotOptin" = "Find-my-vehicle not optin";

/***********************************Navigate Page******************************/


/***********************************Navigate Route Page Start******************/
"NearbyString" = "Nearby";
"RouteTBTStatusTitle" = "Routing";
"RoutePreviewStatusTitle" = "Review route";
"CityName" = "City";
"NOCityName" = "City";
"OriginCityName" = "Start city";
"DestinationCityName" = "Destination city";
"RouteListButtonTitle" = "Details";
"RouteReusltList" = "Route planning result";
"BackToRouteMap" = "Map";
"RouteOriginSelectTitle" = "Please select start point";
"RouteDestinationSelectTitle" = "Please select end point";
"RouteOrigin" = "Start";
"RouteDestination" = "End";
"RouteOrigin1" = "Start";
"RouteDestination1" = "End";
"PleaseInput" = "Please enter ";
"OriginAddress" = "Start address";
"DestinationAddress" = "Destination address";
"MyLocation" = "Current location";

"ShareLocation" = "Share destination";
"ShareWithSMS" = "SMS";
"OriginOrDestination" = "Route setting";

/*
 "SetDestination" = "    Set as end point";
 "SetOrigin" = "    Set as start point";
 */
"SetDestination" = "    End Point";
"SetOrigin" = "    Start Point";

"CancelButtonTitle" = "Cancel";

"RouteDistance" = "Estimated driving distance:";
"Kilometre" = "KM";
"DriveTime" = "Estimated driving time:";
"Hour" = "H";
"Minute" = "m";
"RouteChooseOriginCityTitle" = "Select start city";
"RouteChooseDestinationCityTitle" = "Select destination city";

"SetPageDisplayTraffic" = "RTT";
"SetRouteOptions" = "Route option:";
"SetPageOptionOfShortestRoute" = "Shortest";
"SetPageOptionOfLestPay" = "No toll";
"SetPageOptionOfFastest" = "Fastest";

"GenerateRouteFailedErrorMessage" = "Failed to generate route";
/***********************************Navigate Route Page End******************/



/********************************Assistatent Page******************************/
/* Assitatent Page navigate title label */
"assistantNavigateTitle" = "Guide";

/* Button Report Title */
"assistantButtonReport" = "Vehicle Report";

/* Button Promotion Title */
"assistantButtonPromotion" = "Promotion Info";

/* Button Story Title */
"assistantButtonStory" = "True Story";

/* Button Tips Title */
"assistantButtonTips" = "Operation Tips";

/* Button Contact Title */
"assistantButtonContact" = "Contact OnStar";

/*Report Status Title */
"assistantReportStatusTitle" = "Vehicle Report";

/*Promotion Status Title */
"assistantPromotionStatusTitle" = "Promotion Info";

/*Story Status Title */
"assistantStoryStatusTitle" = "True Story";

/*Tips Status Title */
"assistantTipsStatusTitle" = "Operation Tips";

/* TRUE_STORY */
"TRUE_STORY" = "True Story";

/* ASSISTANT */
"ASSISTANT" = "Operation Tips";

/* Third Part Service */
"ThirdPartService" = "Other Service";

/* Onstar Service */
"OnStarService" = "Onstar Service";

/* PROMOTION */
"PROMOTION" = "Promotion Info";

/* OVD_EMAIL */
"OVD_EMAIL" = "Vehicle Report";

/* OVD Email Info Status Title Lable */
"ovdEmailInfoStatusTitle" = "Vehicle Report Tips";

/* OVD Email Info Content */
"ovdEmailInfoContent" = "OnStar vehicle diagnostics report  will be sent to you every month. You can do diagnostics on your vehicle's key components. The system will also provide you with vehicle maintanence suggestions.";

/* Vehicle Report time */
"vehicleReportDataTime" = "%@/%@/%@ %@:%@:%@";

/* Conetent Language Type*/
"contentLanguageType" = "EN_US";
"currentLanguageType" = "en-US";

/******* Buick Care start ***********/
"BUICK_CARE_JPFW" = "Distinctive Service";
"BUICK_CARE_HDXX" = "Latest Activities";
"BUICK_CARE_YCTS" = "Car Tips";

"assistantBuickCareStatusTitle" =  "Buick Care";
"assistantButtonBuickCare" = "Buick Care";
"assistantBuickCareCreator" = "The First Chinese Car Service Brand";
"assistantBuickCare24HoursHotLine" = "24 Hours Hotline : 400-820-2020";
"assistantBuickCareBetterCare" = "Buick Care, More Than After-sales Service";


"assistantBuickCareBestService" = "Distinctive Service";
"assistantBuickCareActivities" = "Latest Activities";
"assistantBuickCareVehicleCareTips" = "Car Tips";
"assistantBuickCareNoActivites" = "Coming soon…";
/******* Buick Care end   ***********/

/********************************Assistatent Page******************************/


/***********************************Settings Page******************************/
/* Settings Page navigate title label */
//"settingNavigateTitle" = "Options";
"settingNavigateTitle" = "Personal Center";

/*Logout Tip Info */
"logoutTipInfo" = "Are you sure you want to logout?";

/*Logout OK Title */
"logoutOkTitle" = "OK";

/*Logout Cancel Title */
"logoutCancelTitle" = "Cancel";

/* About Page Status Title */
"aboutPageStatusTitle" = "About";

/* About Page Mobile App Title */
"aboutPageMobileAppTitle" = "OnStar Mobile Application";

/* About Page Version Title */
"aboutPageVersionTitle" = "V %@ %@";

/* About Page Copyright Title */
"aboutPageCopyrightTitle" = "Shanghai OnStar Telematics Co. Ltd copyright reserved©2011";

/* Settings Page Button Setting title label */
"settingButtonSetTitle" = "Setting";

/* Settings Page Button About title label */
"settingButtonAboutTitle" = "About";

/* Settings Page Button Broadcast title label */
"settingButtonBroadcastTitle" = "Information";

/* Settings Page Button Logout title label */
"settingButtonLogoutTitle" = "Logout";

/* User not choose vehicle */
"notChooseVehicle" = "Please choose a vehicle";

/* Set Page Status Title */
"setPageStatusTitle" = "Setting";

/* Set Page Button Vehicle Title */
"setPageButtonVehicleTitle" = "Account and Vehicle";

/* Set Page Button Update Title */
"setPageButtonUpdateTitle" = "Vehicle Data Update";

/* Set Page Button Map Title */
"setPageButtonMapTitle" = "Map Setting";

/* Set Page Dispaly Map Title */
"setPageDisplayMapTitle" = "Display Map:";

/* Set Page Not Display Map Title */
"setPageNotDisplayMapTitle" = "Don't Display Map:";

/* Account Vehicle Page Status Title */
"accountVehiclePageStatusTitle" = "Account and Vehicle";

/* Account Label Title */
"accountVehiclePageAccountTitle" = "Account";

"MyAccount" = "My Account";

/* Account Vehicle Title */
"accountVehiclePageVehicleTitle" = "Vehicle";

/* Account VIN Title */
"accountVehiclePageVinTitle" = "VIN";

/* Button OK Title */
"accountVehiclePageButtonOkTitle" = "OK";

/* Button Cancel Title */
"accountVehiclePageButtonCancelTitle" = "Cancel";

/* Vehicle Update Page Status Title */
"vehicleUpdatePageStatusTitle" = "Vehicle Data Update";

/* Vehicle Update Page Update Title */
"vehicleUpdatePageUpdateTitle" = "Auto Vehicle Data Update";

/* Vehicle Management Success Message*/
"vehicleManagementSuccessMessage" = "Change Vehicle successfully.";

/* Vehicle Account Info Status Title Lable */
"vehicleAccountInfoStatusTitle" = "Vehicle Account Tips";

/* Vehicle Account Info Content */
"vehicleAccountInfoContent" = "OnStar mobile application is able to manage multiple vehicles. You can simply select vehicles by clicking the drop-down menu in the account/vehicle management page.";


/* Vehicle Update Info Status Title Lable */
"vehicleUpdateInfoStatusTitle" = "Vehicle Data Update Tips";

/* Vehicle Update Info Content */
"vehicleUpdateInfoContent" = "You can choose wthether to \"refresh the vehicle data automaticlly when log-in\" here.";
/***********************************Settings Page******************************/

"isFirstTimeLoad" = "isFirstTimeLoad";

"ContactNotSupport" = "You can use mobile phone to call OnStar customer service hotline 400-820-1188";

/***********************************Index Page Items ******************************/
"LoginButton" = "Log In";
"VehicleButton" = "Vehicle";
"RemoteControlButton" = "Remote";
"ContactOnstarButton" = "Contact Onstar";
"InformationCenterButton" = "Guide";
"SettingButton" = "Personal Center";
"NavigateButton" = "Navigation";
"ConnectingVehicle" = "Connecting to the vehicle...";
/***********************************Index Page Items ******************************/
"IntelligentHouse"="IntelligentHouse";
"Charge"="Charge Management";
"OpHistory"="Opeartion History";
"SearchIllegally"="Traffic Violation";
"SearchRestrict"="Traffic Limit";
/***********************************find my vehicle start ******************************/
"pollingGetVehicleLocationFailureMessageWithCode" = "Failed to get vehicle location.(%@)";
"pollingGetVehicleLocationTimeOut" = "Failed to get vehicle location.";
"VehicleLocation" = "Vehicle Location";
"FindVehicleLocationSuccess" = "Show vehicle location on map?";
"FindVehicleLocationFailure" = "Failed to get vehicle location.(%@)";
"FindVehicleButtonOkTitle" = "OK";
"FindVehicleButtonCancelTitle" = "Cancel";
"GettingVehicleLocationWait" = "Connecting to the vehicle, please wait a moment";
"GettingVehicleLocationAndRouteWait" = "Connecting to the vehicle and generating route, please wait a moment";
"GettingVehicleLocationAndRouteFailure" = "Failed to get vehicle location and generate route";
"GetVehicleLocationFunctionOptOut" = "You don’t opt-in my vehicle location, please visit www.onstar.com.cn, login and opt-in this service in “Mobile Service”.";
"FirstMultiVehicleOperationAlert" = "Other vehicle related service is running, please try it later";
"MultiVehicleOperationAlert" = "The vehicle is executing your previous request, Not send another request until the previous one completed.";
"CurrentLocationMockPlistFileName" = "CurrentLocationMockEn.plist";
"VehicleLocationMockPlistFileName" = "VehicleLocationMockEn.plist";

"MapGeoCodingError" = "Map service error,please try it later";
/***********************************find my vehicle end   ******************************/

/*********************************** share destination start ******************************/
/*
 "ShareDestination" = "    Share destination";
 "ShareDestinationAlertMessageWithAddress" = "%@ Address:%@\nIf you are OnStar Mobile App users( for iOS and Android system), please click below link to use relevant destination info in your app.\n%@";
 */
"ShareDestination" = "Share";
"ShareDestinationAlertMessageWithAddress" = "%@ Address:%@\nMore information, please click:\n%@";
"ShareDestinationAlertMessageWithoutAddress" = "If you are OnStar Mobile App users( for iOS and Android system), please click below link to use relevant destination info in your app.\n%@";
"ShareDestinationAlertMessageGenerateSMSFailed" = "Failed to invoke your SMS, please retry it.";
"ShareDestinationReceivedMessageAlert" = "You get shared POI %@ Address：%@, Do you want to show it on the map for further function?";
"AlertOKButton" = "OK";
"AlertCancelButton" = "Cancel";
"SMSButton" = "SMS";
"SinaWeiboButton" = "Sina Weibo";
"SinaWeiboAccountBinding" = "Binding";
"SinaWeiboAccountNotBinding" = "Not binding";
"LoginSinaWeiboFailed" = "Login to sina weibo failed";
"ShareToSinaWeiboSuccessful" = "Share to sina weibo successful";
"ShareToSinaWeiboFailed" = "Share to sina weibo failed";

"OkButtonTitle" = "OK";

"LogoutWeibo" = "Cancel";
"ShareWeibo" = "Publish";

"CameraButton" = "Camera";
"AccessAlbumButton" = "Photo Library";
"ClearImageButton" = "Clear Photo";
"ShareWeiboMessage" = "#%@# I use # OnStar Mobile App # shared a location";
"ConfirmToUnbindWeibo" = "Are you sure you want to remove the Sina blog binding?";

"WeiXinFriend" = "Friends";//"WeChat Friends";
"WeiXinMoments" = "Moments";//"WeChat Moments";
"sendFailed" = "Send Message Failed";
"sendSuccess" = "Send Message Success";
"sendCancel" = "Cancel Send Message";
/*********************************** share destination end ******************************/
/*******Package Info start***************/
"Renewpackage"="My Package";
"PackageInfo"="Package Info";
"lblmealTitle"="Package Info";
"lblRemains" ="Remain";
"lblDays"="Days";
"lblstartDate"="Start";
"lblendDate"="End";
"btnRenew"="Renew";
"Experience" ="Experienced";
/*******Package Info end***************/

/* Navigate index Page  title label */
"navigateNavigateIndexTitle" = "Destination Search";

/* Navigate index Page  city label */
"navigateNavigateIndexCity" = "City";

/* Navigate index Page  search label */
"navigateNavigateSearch" = "Search";

"clearHistory"= "Clear History";

"networkError" = "Network Error, please try again later.";

"Network_Error_Toast_Message"="网络请求失败,请检查您的网络";

"clearMap" = "Clear";

/*5.2 New UE*/
"KeyboardDone"= "Done";

"RemoteSetting"="Remote Operation Setting";

"RemoteAudioVibrate"="In-app Alert Sound";

"RemoteAudioVibrate2"="In-app Viberate";


/* join me*/
"RegisterNewUser" = "Register";

"RegisterUser" ="User Name";

"Mobile&Email" = "Mobile/Email";

"SetPassword" = "Password";

"nick" ="Nick Name";

"SameAsUser"="Same as User Name";

"sendCheckCode"="Get code";

"DynamicCode" ="verification code";

"AgreeOnstar" = "Terms and Conditions";

"AgreeRegister"= "Register";

"6to20"="6-25 characters, must include Arabic numbers and English alphabet.";//"6-20 characters,contain letters and numbers";
"6to202"="6-25 characters, must include Arabic numbers and English alphabet.";//"6-20 characters, Numbers or letters are supported and shall not be repeated or continuous";

"5to203"="6-20 characters, cannot be pure Arabic numbers";//用户名

"forgetPwd" ="Forgot password?";

"Finished"="Finish";

"Cancel" = "Cancel";

"upgradeOwner" ="Upgrade to Owner";

"NoAuth"="You are unable to use this service now, please try it after you upgrade to subscriber";



"AlignScan" ="Align your certificate and scan";

"AgreeSubmit" ="Accept and submit";

"VINCer" ="VIN/Certificate";

"VistorRegisterLine1" = "If you are not OnStar Owner,";

"VistorRegisterLine2" = "please click here to register.";

"Second"= "s";

"Resend" = "Re-send";

"ResendCheckCode"="Send dynamic code again";

"AlredySend"="Already sent six-digit verification code to ";

"PhoneNumber"="mobile";

"Email"="Email";

"EnterPhoneNumber" = "Verification code";

"RegAgreeOnstar"="I have read and accept the ";

"SystemCreateAccount"=" System will create your OnStar account automatically";

"VINAccount" = "VIN";

"choosePhoto"= "Choose photo";

"Cancel" ="Cancel";

"NoAroundDealer"="No around  dealer";


"NullField" = "Mandatory Field";

"usernameFormat"="This username is not properly formatted";

"passwordFormat"="This password is not properly formatted";

"mobileFormat" = "This phone number or email address is invalid";

"onlyEamilFormat" ="This email address is invalid";

"onlyMobileFormat" ="This phone number is invalid";

"nickFormat" = "This nickname is not properly formatted";


"userExist"="User name already exist.";

"MobileEmailExist" ="Email or Mobile Number Already Exist.";

"NickNameExist" ="Nickname already exist.";


"findpassword" = "Retrieve Password";
"2to20" ="2-20 characters";
"recieveDcode"="Be used to receive dynamic code";


"PasswordOld" ="old password";

"PasswordNew" ="new password";

"PasswordAgain" ="confirm password";

"AccountInfo" ="Account";

"changePassword" ="Change password";

"fingerprintPassword" ="Fingerprint password";

"CardNumber"= "%d number";

"ID"= "ID";
"Passport"= "Passport";
"VIN"= "VIN";
"OrganizationCode"= "Organization code";

"SelectCardTypeHint"= "After choose certificate type, \nalign the number within the frame and click button to scan";
"PassportHint"= "Only support U.S. passport";
"recognizeFailed"= "Recognition failure, please try again";
"recognizePhotoFailed" ="Failed to get picture, please try again";
/***********************************About Page******************************/
"SB024-01_Features"="Features";
"SB024-02_FAQ"="FAQ";
"SB024-03_OnStar_service_introduction"="OnStar Service Introduction";
"SB024-04_Check_for_updates"="Check for updates";
"SB024-05_Feedback"="Feedback";
"SB024-06_Welcome"="Welcome";
"SB024-08_Submit"="Send";
"TextNoMoreThan200"="Can't input more than 200 characters";

"SB024_MSG001"="Thanks for your feedback";
"SB024_MSG002"="Unable to submit";

"logining" = "Logging in, please wait";
"islogining" = "Logging in";
"upgrading" = "Upgrading, please wait";


//Exception
"SB021-28"="Welcome! You have successfully registered OnStar";
"SB021_MSG001" ="User Name or password is incorrect, please try it again. Tips: System will lock 10 minutes if you type wrong password for 5 times.";

"SB021_MSG032" ="You have typed wrong password for 5 times, system will lock 10 minutes, please try it later.";

"SB021_MSG004" ="Incorrect verification code";
"SB021_MSG005" ="Email or Mobile Number already exist";
"SB021_MSG006" ="Register Failed";

"SB021_MSG007"="Your mobile/email has been used please call 4008201188 to change your personal info to register ";

"SB021_MSG008"="You don't have email/mobile in OnStar，please call 4008201188 complement your personal information ";
"SB021_MSG009"="No around  dealer";
"SB021_MSG010"="You have successfully registered OnStar. Please push the blue button in your vehicle and ask advisor to set up PIN before use.";

"SB021_MSG011"="Congratulations, you have successfully registered OnStar.";

"SB021_MSG012"="You have registered OnStar service, you can login with your registered email/mobile/username, if you have further questions, please call 4008201188";

"SB021_MSG013"="You are unable to use this service now, please try it after you upgrade to subscriber";

"SB021_MSG014"="You do not have permission to use that service";

"SB021_MSG015"="This username is not properly formatted";
"SB021_MSG016"="This password is not correct";
"SB021_MSG017"="This phone number or email address is invalid";
"SB021_MSG018"="This nickname is not properly formatted";
"SB021_MSG019"="This VIN or certificate number is invalid";
"SB021_MSG020"="Your vehicle has more than one identities, please enter certificate number to upgrade";
"SB021_MSG021"="Nick name alerday exist.";
"SB021_MSG022" ="You don't have email/mobile in Onstar，please complement your information on personal center to verify your subscriber indentity";
"SB021_MSG023"="You have successfully upgraded to be OnStar owner. Please push the blue button in your vehicle and ask advisor to set up PIN before use.";
"SB021_MSG024"="Congratulations, you have successfully upgraded to be OnStar owner.";
"SB021_MSG025"="You are not OnStar owner now. Do you want to upgrade to owner?";
"SB021_MSG026"="Password cannot be the same as username";
"SB021_MSG027"="To protect your user experience, please update to the latest version.";
"SB021_MSG030"="Your vehicle is not in the OnStar system, please push the blue button in your vehicle and ask advisor to ensure the vehicle is in our system.";
"SB021_MSG032"="You have typed wrong password for 5 times, system will lock 10 minutes, please try it later.";
"SB022_MSG001"="Mobile number already exist";
"SB022_MSG002"="Email already exist";
"SB022_MSG003" ="Old password is invalid";
"SB022_MSG004"="This password is not correct";
"SB022_MSG005"="Passwords are not the same";
"SB022_MSG006"="This mobile is invalid";
"SB022_MSG007"="This email address is invalid";
"SB022_MSG008"="Change email successfully";
"SB022_MSG009"="Change mobile successfully";
"SB022_MSG010" ="Change password successfully";
"SB022_MSG011" ="Change emial failed";
"SB022_MSG012" ="Change mobile failed";
"SB022_MSG013"= "Change password failed";
"SB022_MSG014" ="New password cannot be the same as old password";
"SB022_MSG015" ="Failed to send dynamic code";
"SB022_MSG016" ="This phone number is not correct";
"SB022_MSG017" ="System is upgrading, please try it later";
"SB022_MSG018" ="Invaild temporary password";

"SB022-04"="Old Mobile";
"SB022-05"="New Mobile";
"SB022-06"="Old Email";
"SB022-07"="New Email";

"SB023-01"="Around Dealers";
"SB023-02"="Prefer Dealer";
"SB023-03"="Change Prefer Dealer";
"SB023-04"="Select Dealer";
"SB023-05"="Load More";
"SB025_SC001" = "No found your perfer, please contact OnStar";
"SB023-10"="Prefer";
"SB023-11"="Nearby";
"SB023-80"="Send To Vehicle";

"DynamicCode"="verification code";
"RecieveCheck" ="Get code";
"changeMobile"="Change Mobile";
"changeEmail"="Change Email";

"ContainSpecial"="Don’t support special character";
"USerNameSpecial"="Don’t support special character";

"SB021-06" ="Get code";
"SB021-08" ="verification code";

"SB021-21" ="If you are not OnStar Owner, please click here to register";
"SB021-22_1" ="Get Code";
"SB021-22" ="Resend";
"SB021-23_3" ="If your information is wrong,";
"SB021-25" ="Registration is regarded as accept Terms and Conditions System create OnStar account synchronously";
"SB021-28" ="You have successfully registered OnStar";
"SB021-36" ="Enter code";

"SB021-40" ="New password has been sent, please check.";
"SB021-41" ="Cannot receive verification code?";
"SB021-42" ="Your verification code will be expired.Are you sure return now? ";
"SB021-43" ="Cancel";
"SB021-44" ="Leave";
"SB021-45" ="Empty";
"SB021-46" ="Return to login page";
"SB021-47" ="Temporary Password";
"SB021-48" ="Case sensitive";
"SB021-49" ="Set password";
"SB021-50" ="Set password";
"SB021-51" ="Enter verification code";
"SB021-52" ="Methods to retrieve";
"SB021-53" ="Registration is regarded as accept Terms and Conditions";
"SB021-53_1" ="I have read and accept the";
"SB021-53_3" =".System will create your OnStar account automatically.";
"SB021-53_2" ="Terms and Conditions of Onstar";
"SB021-54" ="Please enter mobile or emial";
"SB021-55" ="Username";
"SB021-56" ="Password";

"Please_set_your_login_password"="Please set your login password";


"loginUser"="Username/Mobile/Email";
"loginPwd"="Password";
"inputTemp"="Please input temporary password";
"inputNew"="Please set your login password";
"Next" ="Next";
"SB021-17_1"="Your ID or VIN number";
"SB021-17_2"="Please enter your ID or VIN number";
"submit"="Send";
"suggestandfeedback" = "Feedback";
"operationSuccess"="Succeeded";
"operationFailed"="Fail";
"operationInprogress"="In Process";
"ShareTo"="Share to";
"Plssuggest"="Please input your advice of OnStar Mobile app.";
"changeVehicle"="Select vehicle";
"VehicleStatus" ="Vehicle Report";
"Map_Detail"="Details";
"frontTire" ="Front tire placard";
"backTire" ="Rear tire placard";
"ChooseCategory"="Choose Category";
"ChooseCity" ="Choose City";
"PlsNewEmail"="New email";
"PlsNewMobile"="New mobile";
"PlsVerifyCode" ="Verification code";
"changeSave"="Save";
"MyPInfo" ="Personal information";
"SB021-60" ="After choose certificate type, align the number within the frame and click button to scan";
"SB021-61" ="Only support U.S. passport";
"SB021-62" ="Align number within the frame";
"SB021-63" ="Click the button to identify number";
"SB021-64" ="Please input your OnStar PIN";
"allCategory"="All Category";

"communicationDays"="Experienced\n%d\ndays";
"BackIndex"="Back to index page";
"callOnstar"="Call";
"ChooseSearchScope"="Choose search scope";
"MustAgreeOnstar" ="Please accept and check terms and conditions";
"pwdSubmit" ="Submit";
"waitMoment"="Cancel";

"NoBindingEmail"="Please call 400-820-1188 to create your account Email";
"GetCodeViaEmail"="Get the code via Email";

// rate for vehicle
"StatusAndSuggestions" = "Maintenance Suggestion";
"SufficientGas" = "Fuel is sufficient";
"SufficientGasHint1" = "Ready to go!";
"SufficientGasHint2" = "Beware of your oil if you drive far.";
"LowGas" = "Fuel level is low";
"LowGasHint" = "Refuel from nearby gas station in time.";
"EmptyGas" = "Fuel level is insufficient";
"EmptyGasHint" = "Refuel immediately before your vehicle break down.";

"NormalOil" = "Oil life is normal";
"NormalOilHint" = "Engine is under good protection";
"LowOil" = "Oil life is low";
"LowOilHint" = "Engine may have trouble now.
Contact your dealer for professional advise.";
"EmptyOil" = "Oil life is under the line.";
"EmptyOilHint" = "Engine may be in bad condition.
Contact your dealer for professional advise.";
"OnstarOilWarning" = "* If you have changed the oil already, please reset the reading in time.";


"NormalBattery"="Battery is normal";

"LowBattery"="Please recharge the vehicle.";

"EmptyBateery"="Battery is under the line.";

"NormalTirePressure" = "Tire pressure is normal";
"NormalTirePressureHint" = "Ready to go!";
"LowTirePressure" = "Tire pressure is low";
"LowTirePressureHint" = "Adjust according to the recommanded value or contact your dealers if necessary.";
"AbnormalPressure" = "Tire pressure is abnormal";
"AbnormalPressureHint" = "Tyre would be blown with high pressure.
Tyre wear and oil consumption would be increased with low pressure.
Contact your dealer for professional advise in time.";

"MaintainanceTips" = "Maintainance Tips";
"MaintainanceTipsHint" = "According to your odemeters, OnStar suggests you checking below models in time to make sure your vehicle is in good condition.";
"AirFilter" = "·Air Filter";
"FuelFilter" = "·Fuel Filter";
"PowerSteeringOil" = "·Power Steering Oil";
"Restrict" = "·Throttle";
"OilNozzleFuelLine" = "·Fuel Injector, Fuel Pipe";
"EngineCoolant" = "·Engine Coolant";
"TransmissionFluid" = "·Transmission Fluid";
"BrakeFluid" = "·Brake Fluid";
"OnstarWarning2" = "* If you have maintained your vehicle recently, please follow dealers' suggestion.";
"ContactDealer" = "Contact Dealer";

// Open App Alert
"SB028_MSG002" = "您有10天没有刷新车况数据了，请打开安吉星看看吧";
"SB028_MSG003" = "您有20天没有刷新车况数据了，请打开安吉星看看吧";

"GeoFencing"="Security Zone";
"GeoFencingDetail"="Security Zone Details";
"GeoName"="Zone Name";
"GeoCenter"="Zone Center";
"GeoMobile"="Mobile";
"GeoRadius"="Zone Radius";
"GeoKM"="KM";
"GeoExpireDate"="Expire Date";
"geosettingCenter"="Zone Center";
"geosettingMobile"="Mobile";
"geosettingName"="Zone Name";
"geosettingRadius"="Zone Radius";
"geosettingRule"="Trigger rule";
"geoSettingMobileTip"="Mobile is used for receiving SMS";
"geoAdd"="Add Security Zone";
"geoSetting"="Set Security Zone";
"NotifyMobile"="Mobile";
"geoPreview"="Preview Security Zone";
"geo_setting_preview"="Preview";
"Geo_Rule_in"="When enter the zone";
"Geo_Rule_out"="When leave the zone";
"Geo_Rule"="Trigger rule";

"SB00001_MSG001"="You do not have permission to use that service";
"SB00001_MSG002"="You are unable to use this service now, please try it after you upgrade to subscriber";
"SB00001_MSG003"="Failed to get Security Zone info, please try later";
"SB00001_MSG004"="Your vehicle model does not support for this service";
"SB003_MSG001"="Please enter Security Zone name";
"SB003_MSG002"="Security Zone Name is invalid";
"SB003_MSG003"="Please enter Mobile Phone number";
"SB003_MSG004"="Mobile Phone is invalid";
"SB003_MSG005"="Saved";
"SB003_MSG006"="Failed to save Security Zone, please try later";
"SB006_MSG001"="Do you want to delete Security Zone?";


// P&P
"SB001_MSG002"="Failed to connect to vehicle, please re-login the app.";
"SB001_MSG005"="Your service is expired, please contact Onstar to renew your package.";
"SB002_MSG001"="Your current OnStar package is not eligible for these services, You can call 400-820-1188 for help.";
"SB002_MSG002"="OnStar Vehicle Diagnostic report is currently not available";

"deleteSuccess"="Delete success";
"deleteFailed"="Delete Failed";
"ADDSuccess"="add success";
"ADDFailed"="add Failed";
"UpdateSuccess"="Update success";
"UpdateFailed"="Update Failed";
"Geo_OK"="Save";
"Geo_Map"="Map";
"Geo_Delete"="Delete";
"Geo_Update"="Edit";
"Geo_M"="M";
"Geo_KM"="KM";


"OK"="OK";
"WIFI"="In-vehicle Wi-Fi";
"Wifi_title"="In-vehicle Wi-Fi";
"Wifi_Status"="Wi-Fi Status";
"Wifi_proxy_SSID"="Hotspot";
"Wifi_proxy_password"="Password";
"Wifi_SSID"="Please enter hotspot name";
"Wifi_password"="Please enter password";
"Wifi_SSID_comment"="Hotspot name must between 6-18 characters(A-Z,a-z,0-9 only).May contain spaces.";
"Wifi_password_comment"="Password must between 8-14 characters.Alphanumeric characters A-Z,a-z,0-9 only.";
"Wifi_Save"="Save";
"Wifi_Save_success"="If not applied, please ignition off the vehicle, open the driver’s door and ignition on vehicle after 2 minutes.";
"Status_OFF"="OFF";
"Status_ON"="ON";
"Wifi_SSID_format_error"="invalid format";
"Wifi_password_format_error"="invalid format";
"Wifi_getInfo_fail"="Failed to get Wi-Fi Info.(%@)";

"Wifi_getStatus_fail"="Failed to get Wi-Fi Status.(%@)";
"Wifi_status_failure_confirm"="You wouldn't get 4G service once switch off Hotspot. Do you want to continue?";

"Wifi_Save_success_title"="Hotspot settings updated";
"Wifi_setInfo_success"="Update successfully";
"Wifi_setInfo_fail"="Update failure, please try later";
"Wifi_enable_success"="Update successfully";
"Wifi_enable_fail"="Update failure, please try later";
"Wifi_disable_success"="Update successfully";
"Wifi_disable_fail"="Update failure, please try later";
"Wifi_getInfo_timeOut"="Failed to get Wi-Fi Info.";
"Wifi_getStatus_timeOut"="Failed to get Wi-Fi Status.";
"Wifi_setInfo_timeOut"="Failed to update Wi-Fi Info.";
"Wifi_enable_timeOut"="Failed to turn on Wi-Fi.";
"Wifi_disable_timeOut"="Failed to turn off Wi-Fi.";

"Wifi_script"="Enable the Hotspot on your vehicle to enjoy the high-speed 4G function";
"Wifi_off_confirm"="You wouldn't get 4G service once switch off Hotspot. Do you want to continue?";
"Wifi_script_setInfo"="Hotspot name/password change will take effect after the vehicle ignition is turned off, the driver's door is opened.2 minutes have passed and ignition is turned on.";

"OnStarCategory"="Vehicle";
"MapClearTitle" = "Reset map";
"MapGeoFencing" = "Security zone";
"MapTraffic" = "Traffic";
"MapCarPosition" = "CarPosition";
"MapMyPosition" = "MyPosition";
"ContactOnStarByPhone" = "Contact OnStar at";

"OnStarPackage" = "Service Package";
"DataFlow" = "Data Plan";
"RemainServiceDuration" = "Remain Service Duration";
"RemainDataFlow" = "Remain Data Flow";
"ExpireDate" = "Expired Date";
"DataFlowDuration" = "Duration";

"RefreshVehicleDataPromt" = "Refresh the vehicle data?";

"FingerprintOpenSuccessTitle" = "Enable fingerprint password successful!";
"FingerprintCloseSuccessTitle" = "Disable fingerprint password successful!";
"FingerprintOpenSuccessMsg" = "You could get access by fingerprint password to execute vehicle services.";
"FingerprintOpenFailure" = "Please switch on Touch ID in your device setting";
"FingerprintVerifyFailedTryAgain" = "Failed to verify fingerprint password, please use OnStar PIN code";
"FingerprintVerifyFailed" = "Failed to verify fingerprint password";

"FingerprintValidateNavigateTitle" = "Password Verification";
"FingerprintValidateMidTitle1" = "Onstar Fingerprint Password";
"FingerprintValidateMidTitle2" = "Please verify with fingerprint password to execute vehicle services.";
"FingerprintValidatePwd" = "Fingerprint Password";
"FingerprintValidateBottomLeft" = "You could use ";
"FingerprintValidateBottomMid" = "Service Password";
"FingerprintValidateBottomRight" = " for verification";

"FingerprintSettingMsgTitle1" = "OnStar Fingerprint Password Service";
"FingerprintSettingMsgTitle2" = "Could execute Vehicle Service once enabled Fingreprint";
"FingerprintSettingSwitchTitle" = "Fingerprint Unlock";
"FingerprintSettingDealTitle" = "Be deemed to agree with 《Fingerprint Password Agreement》";
"FingerprintSettingServiceAgreementTitle" = "Fingerprint Service Agreement";

"PackageInfoIPhoneOnstarServices" = "Remaining";
"PackageInfoIPhoneDataPlan" = "Remaining";
"FingerprintPasswordVerifyTouchIDMsg" = "Authorize via fingerprint";

"SearchBarButtonTitle" = "Search";

"OpenFingerNavigateTitle" = "Open fingerprint password";
"OpenFingerFinishSting" = "Finish";
"OpenFingerDel" = "Open fingerprint password,Make control more convenient";
"OpenFingerAgree" = "Agree 《fingerprint relevant agreement》";


"SettingVC_MoreLanguages" = "Languages";
"Setting_MoreLanguagesVC_Cancel" = "Cancel";
"Setting_MoreLanguagesVC_Save" = "Save";
"Setting_MoreLanguagesVC_Chinese" = "简体中文";
"Setting_MoreLanguagesVC_English" = "English";
"Setting_MoreLanguagesVC_Iphone" = "System Language";


//"NO_broadcast" = "No broadcast datas";

//"L7_304"="Your entry of PIN is incorrect.";
//"L7_305"="Your incorrect entry of PIN reaches 10 times system limit, your remote control feature will be locked for 30 minutes.Please retry later.";
//"L7_306"="System is busy, please try again later.";
//"L7_001"="Please update your time setting of your device.";
//"L7_201"="Cannot retrieve your information correctly, please try again later.";
//"L7_202"="Cannot retrieve your information correctly, please try again later.";
//"L7_203"="Your username or password is incorrect.";
//"L7_204"="Your username or password is incorrect.";
//"L7_205"="You have typed wrong password for 5 times, system will lock 10 minutes, please try it later.";
//"L7_206"="Your username or password is incorrect.";
//"L7_207"="System is busy, please try again later.";


"L7_001"="Your device system time is incorrect, please update.";
"L7_201"="Cannot get your information correctly, please try again later.";
"L7_202"="Cannot get your information correctly, please try again later.";
"L7_203"="Invalid Username or Password.";
"L7_204"="Invalid Username or Password.";
"L7_205"="System is busy, please try again later.";
"L7_206"="Your login expired, please re-login.";
"L7_207"="System is busy, please try again later.";
"L7_208"="You have typed wrong password for 5 times, system will lock 10 minutes, please try it later.";
"L7_209"="You have typed wrong password for 5 times, system will lock 10 minutes, please try it later.";
"L7_210"="System is busy, please try again later.";
"L7_211"="System is busy, please try again later.";
"L7_212"="System is busy, please try again later.";
"L7_213"="System is busy, please try again later.";
"L7_214"="System is busy, please try again later.";
"L7_215"="System is busy, please try again later.";
"L7_216"="System is busy, please try again later.";
"L7_217"="System is busy, please try again later.";
"L7_301"="System is busy, please try again later.";
"L7_302"="OnStar Password retry reaches 10 times system limit, your remote control feature will be locked for 30 minutes. Please retry later. ";
"L7_303"="OnStar Password retry reaches 10 times system limit, your remote control feature will be locked for 30 minutes. Please retry later. ";
"L7_304"="Invalid OnStar Password , please input again.";
"L7_305"="OnStar Password retry reaches 10 times system limit, your remote control feature will be locked for 30 minutes. Please retry later. ";
"L7_306"="System is busy, please try again later.";
"L7_401"="Your login expired, please re-login.";
"L7_402"="Your login expired, please re-login.";
"L7_403"="Your login expired, please re-login.";
"L7_404"="Your login expired, please re-login.";

// Layer7 Official Error

"invalid_request"="Invalid request, please try again later.";

"server_error"="System is busy, please try again later.";

"invalid_user_credentials"="Invalid Username or Password.please re-enter.";

"invalid_user_credentials_pin"="OnStar Password invalid, you have %d chance left, please re-enter.";

"user_locked"="Account locked, it will last for 10 minutes.";

"invalid_vehicle"="Vehicle info invalid, please contact 4008201188 for help.";

"invalid_account"="Account info invalid, please contact 4008201188 for help.";

"no_supported_vehicles"="Vehicle not supported, please contact 4008201188 for help.";

"unsupported_role"="Your user info invalid, please contact 4008201188 for help.";

"no_pin_configured"="OnStar Password not configured , please contact 4008201188 for help.";

"pin_locked"="OnStar Password retry reaches 10 times system limit, your remote control feature will be locked for 30 minutes. Please retry later. ";

"invalid_token"="Login expired, please re-login.";


"E9004"="As OnStar mobile app system has upgraded, please download the latest version to use our service.";
"Remote_DataRefresh"="Vehicle data refresh";
"Remote_FMV"="find my vehicle";

"PC_ChargeMode"="Charge Mode";
"CM_chargeNowTitle"="Immediate";
"CM_ChargeDealyTitle"="Departure";
"CM_ChargeSmartTitle"="Departure & Rate";
"CM_DepatureTimeTitle"="Departure times";
"CM_ChargeNowDesc"="Immediate Charge upon Plug In";//"Charge upon plugging in";
"CM_ChargeDelayDesc"="Delay Charge Based on Departure Time";//"Complete charge at set time";
"CM_ChargeSmartDesc"="Delay Charge Based on Electric Rates and Departure Time";//"Charge during off-peak hours";
"CM_Save"="Save changes";

"phev_getChargeMode_fail"="failed to get charge mode, please try later.(%@)";
"phev_getChargeMode_timeout"="failed to get charge mode, please try later.";

"phev_setChargeMode_success"="Update successfully";
"phev_setChargeMode_fail"="Update failure, please try later(%@)";
"phev_setChargeMode_timeout"="Update failure, please try later.";

"phev_getSchedule_fail"="failed to get commute schedule,please try later(%@)";
"phev_getSchedule_timeout"="failed to get commute schedule,please try later.";

"phev_setSchedule_success"="Update successfully";
"phev_setSchedule_fail"="Update failure, please try later(%@)";
"phev_setSchedule_timeout"="Update failure, please try later.";

"State_charging"="Charging";
"State_notCharge"="Not charging";
"State_done"="Fully charged";
"aboutTime"="Full Charge %@";
"EVRange"="EV Range";
"TotalRange"="Total Range";


"day_0"="Sunday";
"day_1"="Monday";
"day_2"="Tuesday";
"day_3"="Wednesday";
"day_4"="Thursday";
"day_5"="Friday";
"day_6"="Saturday";


//无首选经销商
"NO_PreferDealer"="You have not set prefer dealer yet.";
"fail_PreferDealer"="Cannot get your prefer dealer temporarily. try again later.";

//周边经销商[无或者获取失败]
"NO_AroundDealer"="There’s no nearby dealers";
"fail_AroundDealer"="Cannot get around dealers temporarily, try again later.";

//获取OVD失败或者OVD内容为空
"NO_OVD"="Currently there’s no valid OVD report for your vehicle.";
"fail_OVD"="Cannot get your vehicle report temporarily, try again later.";

//热销，1年，2年的tab下无任何在售包
"NO_Tab_package"="There’s no package for sell temporarily.";
"fail_Tab_package"="Get package info failed, try again later.";

//没有消息
"NO_broadCast"="No broadcast temporarily.";
"fail_broadCast"="Get broadcast failed, try again later.";

//用户当前无套餐包（核心套餐，流量套餐）
"NO_package"="Current no valid package for your vehicle.";
"fail_package"="Get current package info failed, try again later.";
"fail_package_try"="Connection timeout, Please click on the screen to refresh";

//用户收藏夹为空
"NO_favoritePOI"="You have not save any favorite POI.";
"fail_favoritePOI"="Get your favorite POI info failed, try again later.";

//用户下发历史为空
"NO_TBT_History"="There’s no navigation history.";
"fail_TBT_History"="Get navigation history failed, try again later.";

//用户订单记录为空
"NO_orderHistory"="There’s no order history.";
"fail_orderHistory"="Get order history failed, try again later.";
"NO_orderHistory~"="There’s no order history";
//用户预付费卡激活历史
"NO_PPCHistory"="There’s no Prepaid card activation history.";
"fail_PPCHistory"="Get Prepaid card activation history failed, try again later.";

//用户最近操作为空
"NO_recentOperation"="There’s no recent vehicle operation history.";
"fail_recentOperation"="Get recent vehicle operation history failed, try again later.";

"sendFristVehicleSet"="Navigation Preference";
"TurnbyTurnNavigation"="Turn-by-Turn Navigation";
"On-BoardNavigation"="On-Board Navigation";
"saveAndExit"="saveAndExit";

"SumRemainUsage"="Sum Remain Usage";

"wifi_get"="Get Hotspot Info";
"wifi_set"="Set Hotspot Info";
"wifi_enable"="Enable Hotspot Info";
"wifi_disable"="Disable Hotspot Info";

"ev_getMode"="Get charge mode";
"ev_setMode"="Set charge mode";
"ev_getSchedule"="Get commute schedule";
"ev_setSchedule"="Set commute schedule";


"PIN_flash"="Flash";
"PIN_horn"="Horn";

"CS_Good"="Excellent";
"CS_Normal"="Good";
"CS_Bad"="Poor";
"CS_Diagnosing"="Diagnosing...";
"CS_NoRefresh"="Tap refresh button on the upright to learn the status of your vehicle!";
"refresh_fail"="Diagnosing failed, try again later.";
"refresh_fail1"="Diagnosing failed,";
"refresh_fail2"="try again later.";

"Finger_onstar"="Onstar’s Touch ID";
"Finger_TouchID"="please check your Touch ID";
"Finger_NOSet"="You not set your Toch ID, click to set";
"Finger_input"="Input password";

"call"="Call";
"rm_locking"="locking door...";
"rm_unlocking"="unlocking door...";
"rm_remoteStarting"="remote starting...";
"rm_remtoeStoping"="cancel remote starting...";
"rm_alerting"="Horning & Flashing";

"image_loading"="Tap refresh button on the upright to learn the status of your vehicle!";


"Ignition_on"="Remote start";
"Ignition_off"="Cancel start";
"Lock_door"="Door lock";
"Unlock_door"="Door unlock";
"Horn_and_Light"="Horns & Lights";

"Vehicle_diagnostic_report"="Diagnostics";
"Contact_Onstar"="Call Us";
"Dealer_reservation"="Dealer reservation";
"Violation_query"="违章查询";
"Query_traffic_violation"="Query violation";
"Query_traffic_limitation"="Query traffic limitation";

"Wifi_management"="In-vehicle Wi-Fi";
"Wifi_info_view"="In-vehicle Wi-Fi";

"Geo_fencing"="Security zone";
"Prefer_dealer"="Prefer dealer";
"Recent_vehicle_operation_history"="Recent history";

"Real_time_traffic"="Show traffic";
"POI_search"="Search POI";
"Quick_go_home"="To home";
"Quick_go_to_office"="To office";
"Find_my_Vehicle"="Locator";

"Upgrade_to_subscriber"="Upgrade";
"Onstar_true_story"="True story";
"Onstar_service_introduction"="Introduction";
"Set_charge_mode"="Set charge mode";
"Departure_time"="Departure time";
"Charge_notification"="Charge notification";

"page_loading"="Loading";


"tab_carStatus"="tab_carStatus_en";
"tab_remote"="tab_remote_en";
"tab_housekeeper"="tab_housekeeper_en";

"tab_carStatus_iPhone4"="tab_carStatus_4_en";
"tab_remote_iPhone4"="tab_remote_4_en";
"tab_housekeeper_iPhone4"="tab_housekeeper_4_en";

"tab_carStatus_iPhone5"="tab_carStatus_5_en";
"tab_remote_iPhone5"="tab_remote_5_en";
"tab_housekeeper_iPhone5"="tab_housekeeper_5_en";


"inPutCaptchaImage"="Verification code is required";
"changeOneCaptchaImage"="Try a new one";
"inPutCaptchaImageError"="Incorrect verification code, please re-input";

"Information"="Notification";
"Settings"="Settings";
"Help"="Help";
"HelpDetail"="Help Detail";
"Feedback"="Feedback";
"About"="About";
"VehicleInformation"="Vehicle Information";
"UserManual"="User Manual";

"My_Account"="My Account";
"Head_photos"="Portrait";

"chargeComplete"="Charging complete notification reminders";
"chargeInterrupted"="Charging interrupt notification reminders";
"chargeNot"="Charging notifications";

"Call_change"="You can update mobile or email by call :";

"Not_Onstar_Subscriber"= "Not Onstar Subscriber yet? Click here";
"Failed_try_again_later"="Failed, try again later.";
"Failed_try"="Failed, try again later.";
"Bad_connection"="Bad connection, try again later.";
"Success_S"="Success";

"Remote_Control"="Remote Control";
"Vehicle_service"="Vehicle service";
"Vehicle_control"="Vehicle control";
"Navigation"="Navigation";
"Personal_service"="Personal service";
"Sort_Delete"="Sort & Delete";
"Drag_to_sort"="Drag to sort";
"Click_to_Edit_More"="Add more by clicking icon";
"OnStar_Mobile_Application"="OnStar Mobile Application ";

"Cannot_add_more"="Cannot add more, please delete somes before adding more";
"Edit_more_pressing"="Edit more by long pressing";
"Experienced_days"="Experienced days";
"Data_plan_remaining"="Data plan remaining";
"Edit_more_by_long_pressing"="Edit more by long pressing icons";

"Fingerprint_Unlock"="Fingerprint Unlock";
"Fingerprint_Password"="Fingerprint Password";
"OnStar_Fingerprint_Password_Service"="OnStar Fingerprint Password Service";
"Service_Could"="Could execute Vehicle Service once enabled Fingerprint.";
"Connecting_the_vehicle"="Connecting the vehicle…";

//"Tap_RegisterBtn"="‘Register’ mean you agree with";
"Are_you_sure"="Are you sure you want to leave without save our changes";
"Discard_changes"="Discard changes";
"Continue_editing"="Continue editing";
"Account"="Account";
"Change_Password"="Change Password";
"Fingerprint_Password"="Fingerprint Password";

"True_Story"="True Story";
"Operation_Tips"="Operation Tips";
"OnStar_Service_Introduction"="OnStar Service Introduction";
"Information_Detail"="Information Detail";



//吉星    英文管家
"Vehicle_Control" = "Vehicle Control";
"Vehicle_Service" = "Vehicle Service";
"OnStar_Package" = "OnStar Package";
"Data_Plan" = "Data Plan Package";
"Prepaid_Card" = "Prepaid Card Active";
"Wifi_Management" = "In-vehicle Wi-Fi";
"Charge_Mode" = "Set Charge Mode";
"Security_Zone" = "Security Zone";
"Prefer_Dealer" = "Prefer Dealer";
"Recent_History" = "Recent History";
"Vehicle_Report" = "Vehicle Diagnostic Report";
"Contact_OnStar" = "Call Us";
"Dealer_Reservation" = "Dealer service";
"Quickly_go_home" = "To home";
"Quickly_go_to_office" = "To office";
"Navigation" = "Navigation";
"Buick_Care" = "Buick Care";
"Distinctive_Service" = "Distinctive Service";
"Latest_Activities" = "Latest Activities";
"Car_Tips" = "Car Tips";
"Prepaid_Card_Number" = "Prepaid Card Number";
"History_Record" = "History Record";
"VIN" = "VIN";
"Please_Input_VIN" = "Please Input VIN";
"Next_Step" = "Next Step";
"Activate_Now" = "Activate Now";
"Please_Input_Password" = "Please Input Password";
"Confirm" = "Confirm";
"Please_Choose_Your_Vehicle_Model" = "Please Choose Your Vehicle Model";
"Vehicle_Management" = "Vehicle Management";
"Plate_Number" = "Plate Number";
"Plate_Number_Format_Error"="Dont Match Plate Number Format";
"Save" = "Save";
"Engine_Number" = "Engine Number";
"Please_Input_Plate_Number" = "Please Input Plate Number";
"Vehicle_Switch" = "Vehicle Switch";
"Choose_Prefer_Dealer" = "Choose Prefer Dealer";
"Prefer_Dealer" = "Prefer Dealer";
"Address" = "Address";
"City" = "City";
"Mobile" = "Mobile";


"Dealer" = "Dealer";
"Onstar_PIN"="PIN";
"Onstar_Contact_Number"="If forget service password, contact onstar by call 400-820-1188";
"rm_label_Tip"="Instruction";

"want_to_logout"="Are you  sure you want to logout ？";

"Send_TBT"="Turn-by-turn navigation";
"Send_ODD"="On-board navigation";
"Navigation_options"="Navigation options";

"Super_Butler"="SuperButler";
"Driver"="Driver";
"Restaurant"="Restaurant";
"Golf"="Golf";
"enter_the_verification"="Please enter the verification code on the right";
"updated_Mobile_Email"="You can login with the updated Mobile or Email.";


"Order_history" = "Order history";
"Data_plan_package" = "Data plan package";
"Remaining" = "Remaining";
"Total_remaining" = "Total remaining";
"Start" = "Start";
"End" = "End";
"Duration" = "Duration";
"Day" = "Days";

"RM_IKnown"="I know";
"least_four_shortcuts"="At least four shortcuts are needed.";
"RM_makeSure"="Are you sure to quit?";
"RM_input_PIN"="Enter service password";
"RM_OK"="OK";
"Personal_Information"="Personal Information";
"Upload_succeeded"="Upload succeeded";
"Upload_failed"="Upload failed";

"Select_image"="Select image";
"Choose_from_photos"="Choose from photos";
"Take_photo"="Take photo";

"Verify_by"="Verify by";
"Mobile_"="Mobile";
"Mobile_r" = "Mobile";

"Navigate_Home_Search"="Search";
"Navigate_Home_Roud_Condition"="";
"Navigate_Home_Car_Location"="";
"Navigate_Home_My_Location"="";
"Navigate_Home_Clean"="Reset";
"Navigate_Home_Confirm_Address"="Confirm Address";

"Navigate_Position_View_My_Location"="My current location";
"Navigate_Position_View_TBT"="TBT";
"Navigate_Position_View_ODD"="ODD";
"Navigate_Position_View_Around_Search"="Around search";
"Navigate_Position_View_Around_Dealer"="Around dealers";
"Navigate_Position_View_Share"="Share";
"Navigate_Position_View_Route"="Route planning";
"Navigate_Position_View_Ensure"="Confirm";

"Navigate_Search_Input_Address"="Please input address";
"Navigate_Search_TransPort"="Transportation";
"Navigate_Search_Food"="Food & lodging";
"Navigate_Search_Shopping"="Shopping";
"Navigate_Search_Life"="Living service";
"Navigate_Search_More"="More";
"Navigate_Search_Home"="Home";
"Navigate_Search_Company"="Office";
"Navigate_Search_Home_SetAddress"="Set home address";
"Navigate_Search_Company_SetAddress"="Set office address";
"Navigate_Search_History"="History";
"Navigate_Search_Collection"="Favorite";
"Navigate_Search_More_History"="More search history";
"Navigate_Search_Clean_History"="Clear history";
"Navigate_Search_More_Send_History"="More navigation history";
"Navigate_Search_Send_To_Car"="Navigation";
"Navigate_Search_Load_Previous_Result"="Load previous 10 records";
"Navigate_Search_Load_Next_Result"="Load next 10 records";
"Navigate_Home_My_FootPrint"="My FootPrint";

"Navigate_MoreView_More"="More";
"Navigate_MoreView_Transport"="Transportation";
"Navigate_MoreView_Restaurant"="Restaurant";
"Navigate_MoreView_Shopping"="Shopping";
"Navigate_MoreView_Life"="Living service";
"Navigate_MoreView_Car"="Vehicle";
"Navigate_MoreView_Sports"="Recreation";
"Navigate_MoreView_Scenery"="Spot";
"Navigate_MoreView_Government"="Government";
"Navigate_MoreView_Business"="Business";
"Navigate_MoreView_Others"="Others";

"Navigate_Home_Setting_Input_Address"="Please input address";
"Navigate_Home_Setting_My_Position"="Current locaion";
"Navigate_Home_Setting_Car_Position"="Vehicle location";
"Navigate_Home_Setting_Clean_History"="Clear history";
"Navigate_Home_Setting_Pick_Point"="From map";

"Navigate_Types_Search_Input_Address"="Please input address";
"Navigate_Types_Search_3Km"="3km";
"Navigate_Types_Search_5Km"="5km";
"Navigate_Types_Search_Whole_City"="Whole city";
"Navigate_Types_Search_Send_To_Car"="Navigation";
"Navigate_Types_Search_Phone"="Call";
"Navigate_Types_Search_Sort_Distance"="Distance ranking";
"Navigate_Types_Search_Sort_Defult"="Mix ranking";

"Navigate_Detail_Title"="Details";
"Navigate_Detail_ODD"="On-board navigation";
"Navigate_Detail_TBT"="Turn-by-turn navigation";
"Navigate_Detail_Around_Dealer"="Around dealers";
"Navigate_Detail_Around_Search"="Search Nearby";
"Navigate_Detail_Collect"="Favorite";
"Navigate_Detail_Route"="Route plan";

"Navigate_Notification_Route_Same_Begin_And_End"="Please set different begin and end point";

"Navigate_Route_Title"="Route plan";
"Navigate_Route_My_Position"="Current location";
"Navigate_Route_End"="End point";
"Navigate_Route_History"="Route history";
"Navigate_Route_End"="Start point";

"Navigate_Route_List_Title"="Route result";
"Navigate_Route_List_Distance_Title"="Estimated trip distance";
"Navigate_Route_List_Time_Min"="m";
"Navigate_Route_List_Time_Hour"="h";
"Navigate_Route_List_Distance_Km"="km";
"Navigate_Route_List_Distance_M"="m";
"Navigate_Route_List_Fast"="Fartest";
"Navigate_Route_List_Short"="Shortest";
"Navigate_Route_List_No_Fast_Way"="No higway";

"Navigate_Notification_Location_Failed"="Retrieve current location failed.";
"Navigate_Notification_Cannot_Get_Location"="Cannot get current location.";
"Navigate_Notification_Save_Failed"="Save failed.";
"Navigate_Notification_No_Home_Address"="You haven’t save home address, set right now ?";
"Navigate_Notification_No_Company_Address"="You haven’t save office address, set right now ?";
"Navigate_Notification_Home_Set_Success"="Home address setting successful, are you sure you want to navigation now?";
"Navigate_Notification_Company_Set_Success"="Office address setting successful, are you sure you want to navigation now?";
"Navigate_Notification_Login_To_Check"="You have to login to check favorite POI";
"Navigate_Notification_No_History"="There’s no history data";
"Navigate_Notification_No_Address"="There’s no address info";
"Navigate_Notification_No_PhoneNum"="There’s no phone number";
"Navigate_Notification_No_Route_Begin"="Please set start point";
"Navigate_Notification_No_Route_End"="Please set end point";
"Navigate_Notification_No_Search_Result"="Sorry, no related data, try a new one.";
"Navigate_Notification_Please_Input_NickName"="Please input nick name";

"Get_Location_InProcess"="Getting the current location, please wait for a minute.";
"Get_Location_Failed"="Currently the network unavailable, please try again later.";

"Navigate_Alert_Make_Phone_Call"="Are you sure you want to dial out";
"Navigate_Alert_Delete_Search_History"="Are you sure you want to clear history?";
"Navigate_Alert_Delete_Collect"="Are you sure you want to delete the POI ?";
"Navigate_Alert_YES"="YES";
"Navigate_Alert_NO"="NO";

"Wifi_edit_title"="Edit Hotspot name";
"password_edit_title"="Edit Hotspot password";
"Save_vehicle_image_success" = "Save vehicle image success！";
"use_it" = "Sure";
"CancelTitle" = "Cancel";
"Set_engine_number" = "Set engine number";
"Set_the_license_plate_number" = "Set the license plate number ";
"modify" = "modify";

"CM_alert"="Notification Settings";

"comments_Good"="Excellent, please keep going.";
"comments_Normal"="Good, don't forget go to dealer store for maintenance regularly.";
"comments_Bad"="Ooops… attention ,please go to the dealer store for diagnostic.";

"wifi_script1"="Wi-Fi Hotspot";
"wifi_script2"="You can also view the 4G LTE Wi-Fi hotspot & password info through mobile app.";
"wifi_script3"="Eidt your preferred hotspot and password by clicking ”>“ icon, and Click save button ,input OnStar service password , Set your Wi-Fi info successfully.";


"No_data_left" = "No data left, purchase now.";
"engine" = "engine";
"license_plate" = "license plate";
"error_please_re-enter" = "error, please re-enter";
"no_prefer_dealer" = "No preferred dealer";

"Your_issue"="Your issue and suggestion";
"FourPhotos"="Images (optional,a maximum of four tickets)";
"proble_you"="Please briefly describe your issue with comments";

"mobile_same"="New mobile cannot be the same as old mobile";
"email_same"="New email cannot be the same as old email";

"Purchase"="Purchase";
"Submitted_successfully"="Submitted successfully";
"Thanks_feedback"="Thanks for your feedback, we will deal with your issue as soon as possible.";

"Close_Btn"="Close";
"not_OnStar_package"="Currently you do not have any valid OnStar package";

"Coming_soon_True_Story"="Coming soon...";
"Coming_soon_Operation_Tips"="Coming soon...";
"Coming_soon_OnStar_Service_Introduction"="Coming soon...";

"Charge_Station_Connect_Failed"="Network temporarily unstable, please try again later.";
"Charge_Station_Get_Message_Failed"="Please check the network setting, try again.";
"Charge_Station_No_Result"="No results, please try again.";


"rm_lock_tip"="Doors will be locked. Be cautious of your safety and the cars around!";
"rm_unlock_tip"="Doors will be unlocked. Be cautious of your safety and the cars around!";
"rm_start_tip"="Please ensure the key is not left in the car , and keep at least 30 meters away from your car.";
"rm_cancel_tip"="This action only applies to the situation that the engine was started by remote control last time.";
"rm_alert_tip"="Please ensure the car gear is put in Parking. Horns and lights will be stopped automatically after 30 seconds.";

"signIn_SignUp"="Sign in/ Sign up";
"Me_Recent_History"="Recent History";
"VIN_Number"="VIN Number";
"Vehicle_Series"="Series";
"Vehicle_Model" = "Model";
"Switch_Vehicles" = "Switch Vehicles";
"Insurance_Company" = "Insurance Company";
"CLIVTA_expiry" = "CLIVTA expiry";
"Vehicle_Insurance_expiry" = "Vehicle Insurance expiry";
"Drive_License_Expired_Date" = "Drive License Expired Date";
"learn_more" = "learn more";
"Smart_Driver" = "Smart Driver";
"My_Privilege" = "My Privilege";
"DateExit"="Cancel";
"DateConfirm"="OK";
"Please_Select_Time"="Please Choose a date";
"Clear_Cache"="Clear Cache";
"Clear_Cache_SucessMessage" = "Clear Cache successfully.";
"Smart_Driver_Service" = "Smart Driver Service";
"Current_Vehicle" = "Current Vehicle";
"Retry" = "Retry";
"LoadDrivingBehaviorStatusErrInfo" = "Failed to obtain the latest information of Smart Driver Service. Do you want to try again?";
"NoDiscountDataInfo" = "There are no special offers currently. Please come back later.";
"Map_geo"=" ";
"Map_No_Foot_Print"="There is no footprint currently. Expriencing our navigation function now!";
